### Terraform Plan Output:
#### Terraform init: success
#### Terraform fmt: success
#### Terraform validate: success
#### Terraform plan: success

<details>
<summary>Plan Details</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_artifact_registry_repository.app_repo will be created
  + resource "google_artifact_registry_repository" "app_repo" {
      + create_time      = (known after apply)
      + description      = "Docker repository for Alien Synth Pad application"
      + effective_labels = (known after apply)
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "us-central1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "interns-aleksandra"
      + repository_id    = "alien-synth-pad"
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)
    }

  # google_cloud_run_service_iam_member.public will be created
  + resource "google_cloud_run_service_iam_member" "public" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = "allUsers"
      + project  = "interns-aleksandra"
      + role     = "roles/run.invoker"
      + service  = "alien-synth-pad"
    }

  # google_cloud_run_v2_service.app will be created
  + resource "google_cloud_run_v2_service" "app" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + effective_annotations   = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + name                    = "alien-synth-pad"
      + observed_generation     = (known after apply)
      + project                 = "interns-aleksandra"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + image = "us-central1-docker.pkg.dev/interns-aleksandra/alien-synth-pad/alien-synth-pad:latest"

              + liveness_probe (known after apply)

              + ports {
                  + container_port = 8080
                  + name           = (known after apply)
                }

              + resources {
                  + limits = {
                      + "cpu"    = "1000m"
                      + "memory" = "512Mi"
                    }
                }

              + startup_probe (known after apply)
            }

          + scaling (known after apply)
        }

      + traffic (known after apply)
    }

  # google_project_service.required_apis["artifactregistry.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "interns-aleksandra"
      + service                    = "artifactregistry.googleapis.com"
    }

  # google_project_service.required_apis["cloudbuild.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "interns-aleksandra"
      + service                    = "cloudbuild.googleapis.com"
    }

  # google_project_service.required_apis["run.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "interns-aleksandra"
      + service                    = "run.googleapis.com"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + artifact_registry_repository = (known after apply)
  + cloud_run_url                = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>